app/Controllers/usuario_controller.php

INSERT INTO `usuario` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('gonzalo', 'front', 'gonzaFront', 'gonzalo@front.com', '$2y$10$/qn0FuQzlA23XSJbyq4y4.U85kLvqlBBoWitsA2QGuDQzvj0PnVXS')
---
    public function formValidation(){
        $input = $this->validate([
            'nombre' => 'required|min_length[3]|max_length[50]',
            'apellido' => 'required|min_length[3]|max_length[50]',
            'usuario' => 'required|min_length[3]|max_length[20]',
            'email' => 'required|min_length[3]|max_length[100]|valid_email|is_unique[usuario.email]',
            'pass' => 'required|min_length[6]|max_length[100]|matches[confirm_password]',
            'confirm_password' => 'required|min_length[6]|max_length[100]'
        ],
    );
    $formModel = new usuario_Model();

    if(!$input) {
        $data['titulo']='Registro';
        echo view('front/head_view', $data);
        echo view('front/nav_view');
        echo view('back/usuario/registro', ['validation' => $this->validator]);
        echo view('front/footer_view');
    } else {
        $formModel->save([
            'nombre' => $this->request->getVar('nombre'),
            'apellido' => $this->request->getVar('apellido'),
            'usuario' => $this->request->getVar('usuario'),
            'email' => $this->request->getVar('email'),
            'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)


        ]);